"""
bit.ly/lenibii
https://lenivii.wordpress.com/wp-admin/post.php?post=4&action=edit
https://lenivii.wordpress.com/2015/06/27/igra/#more-4

Описание игры «Захват Марса»
Июнь 27, 2015 zapomniadres Uncategorized
Предыстория

Военные операции по захвату Марса провалились. Потому что в распоряжении марсиан находится неограниченный ресурс боеспособных жителей. Поскольку марсиане это однополые существа, размножающиеся клонированием, их технологии позволяют им в короткое время создавать огромную боеспособную армию. В связи с этим на Земле было принято решение разработать невоенную стратегию захвата Марса.

Стратегия захвата Марса

Земляне разработали кибернетические организмы гуманоидного типа, которые высаживаются маленькими группами на поверхности Марса и захватывают в плен марсиан. После определённых операций по внедрению в мозг захваченных марсиан имплантов, марсиане переходят под контроль Суперкомпьютера, находящегося на Земле.

Тактика 

Кибернетические организмы объединены в некие формации типа «семья». Отличительным признаком каждой семьи является family name — фамилия. Каждый киборг имеет уникальное имя, которое не повторяется в пределах семьи.

Соответственно, пленённые марсиане относят себя к той семье, члены которой проводили операцию по перехвату интеллектуального контроля над марсианином.

Со временем, семьи разростаются и захватывают власть в населенных пунктах Марса. Это возможно благодаря системе электронной демократии и выборов.

В начале операции используются так называемые начальные группы киборгов — НГК или «бригады».

Состав бригады (Роли или специализации)

В состав бригады входят следующие типы киборгов:

Координатор — Coordinator

Перехватчик — Infector

Солдат — Soldier

Техник или медик — Technician

Географ или разведчик — Scout

Строитель — Construction worker

Новичок — Newcomer

Параметры участника бригады

Имя — First name

Фамилия — Family name

Роль (специализация) — Role

Топливная емкость — Fuel capacity

Расход топлива в час — Fuel usage per hour

Количество транспортируемого оборудования — Hardware reserve

Расход оборудования в час — Hardware usage per hour

Расстояние, покрываемое за час — Distance per hour

Наличие оружия — Weapons

Количество боеприпасов — Ammunition

Расход боеприпасов в час — Ammunition usage per hour

 

Fuel capacity	Fuel usage per hour	Hardware reserve	Hardware usage per hour	Distance per hour	Weapons	Ammunition	Ammunition usage per hour
Coordinator	1000000	1	0	0	20	yes	1000	100
Infector	500000	2	1000	10	15	no	0	0
Soldier	500000	2	0	0	20	yes	2000	200
Technician	500000	3	1000	20	15	yes	1000	100
Scout	1000000	2	0	0	30	yes	1000	100
Construction worker	500000	3	1500	40	10	no	0	0
Newcomer	0	0	0	0	0	no	0	0
"""

